faronov/cc2530-zigbee/tests/test_mac_association.c
#ifdef CC2530_HOST_TEST
#include <stdio.h>
#include <stdlib.h>

static uint16_t receive_profiles(void)
{
    mac_frame_info_t frame, unchanged;
    mac_header_t header;
    unsigned form, n;
    uint32_t fcf;
    uint8_t *exact, length;
    uint8_t encoded[126], untouched[126];
    for (form = 0; form < 2; form++) {
        const uint8_t *wire = form ? explicit_pan : golden;
        unsigned size = form ? sizeof(explicit_pan) : sizeof(golden);
        for (fcf = 3; fcf <= 0xffff; fcf += 8) {
            memcpy(body, wire, size);
            body[0] = (uint8_t)fcf; body[1] = (uint8_t)(fcf >> 8);
            memset(&frame, 0xa5, sizeof(frame)); unchanged = frame;
            if (mac_frame_decode_profile(body, (uint16_t)size, &frame,
                                         MAC_RX_R22_ASSOCIATION_RESPONSE) == MAC_CODEC_OK) {
                CHECK(fcf == (form ? 0xcc23 : 0xcc63) || fcf == (form ? 0xcc33 : 0xcc73));
                CHECK(frame.payload_offset == size - 4 && frame.payload_length == 4);
                CHECK(frame.header.source_pan == 0x1234 && frame.header.destination_pan == 0x1234);
            } else {
                CHECK(fcf != (form ? 0xcc23 : 0xcc63) && fcf != (form ? 0xcc33 : 0xcc73));
                CHECK(memcmp(&frame, &unchanged, sizeof(frame)) == 0);
            }
        }
        for (n = 0; n <= 126; n++) {
            exact = malloc(n ? n : 1); CHECK(exact != NULL);
            memset(exact, 0xc7, n); memcpy(exact, wire, n < size ? n : size);
            memset(&frame, 0xa5, sizeof(frame)); unchanged = frame;
            CHECK((mac_frame_decode_profile(exact, (uint16_t)n, &frame,
                   MAC_RX_R22_ASSOCIATION_RESPONSE) == MAC_CODEC_OK) == (n == size));
            if (n != size) CHECK(memcmp(&frame, &unchanged, sizeof(frame)) == 0);
            free(exact);
        }
        CHECK(mac_frame_decode_profile(wire, (uint16_t)size, &frame,
              MAC_RX_R22_ASSOCIATION_RESPONSE) == MAC_CODEC_OK);
        header = frame.header;
        memset(encoded, 0xa5, sizeof(encoded)); memcpy(untouched, encoded, sizeof(encoded));
        length = 0xc7;
        CHECK(mac_frame_encode(&header, wire + size - 4, 4, encoded, sizeof(encoded), &length)
              == (form ? MAC_CODEC_INVALID_HEADER : MAC_CODEC_OK));
        if (form) {
            CHECK(length == 0xc7 && memcmp(encoded, untouched, sizeof(encoded)) == 0);
            CHECK(mac_frame_decode(wire, (uint16_t)size, &frame) == MAC_CODEC_INVALID_HEADER);
        } else {
            CHECK(length == size && memcmp(encoded, wire, size) == 0);
        }
        header.flags |= MAC_FLAG_PENDING;
        memcpy(untouched, encoded, sizeof(encoded)); length = 0xc7;
        CHECK(mac_frame_encode(&header, wire + size - 4, 4, encoded, sizeof(encoded), &length)
              == MAC_CODEC_INVALID_HEADER);
        CHECK(length == 0xc7 && memcmp(encoded, untouched, sizeof(encoded)) == 0);
        for (n = 0; n <= 0xffff; n++) {
            memcpy(body, wire, size);
            body[size - 3] = (uint8_t)n; body[size - 2] = (uint8_t)(n >> 8);
            CHECK((mac_frame_decode_profile(body, (uint16_t)size, &frame,
                   MAC_RX_R22_ASSOCIATION_RESPONSE) == MAC_CODEC_OK) == (n != 0xffff));
        }
        for (n = 0; n < 256; n++) {
            memcpy(body, wire, size);
            body[size - 3] = body[size - 2] = 0xff; body[size - 1] = (uint8_t)n;
            CHECK((mac_frame_decode_profile(body, (uint16_t)size, &frame,
                   MAC_RX_R22_ASSOCIATION_RESPONSE) == MAC_CODEC_OK) == (n == 1 || n == 2));
        }
        for (n = 0; n < 4; n++) {
            setup(); memcpy(body, wire, size); event.length = (uint16_t)size; event.stamp = now;
            if (n & 1) body[3] = body[4] = 0xff;
            if (n & 2) body[form ? 13 : 3] ^= 1;
            CHECK(mac_frame_decode_profile(body, (uint16_t)size, &frame,
                  MAC_RX_R22_ASSOCIATION_RESPONSE) == MAC_CODEC_OK);
            CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
            CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
            CHECK(mac_association_step_rx(&ctx, now, &event, &observation,
                  MAC_RX_R22_ASSOCIATION_RESPONSE) == MAC_ASSOCIATION_OK);
            CHECK(observation == ((n == 0 || (form && n == 1))
                  ? MAC_ASSOCIATION_RESPONSE : MAC_ASSOCIATION_MISMATCH));
        }
    }
    for (n = 2; n < 256; n++) {
        memset(&frame, 0xa5, sizeof(frame)); unchanged = frame;
        CHECK(mac_frame_decode_profile(golden, sizeof(golden), &frame, (uint8_t)n)
              == MAC_CODEC_INVALID_ARGUMENT);
        CHECK(memcmp(&frame, &unchanged, sizeof(frame)) == 0);
        setup();
        CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
        saved = ctx; observation = 0xa5;
        CHECK(mac_association_step_rx(&ctx, now, &event, &observation, (uint8_t)n)
              == MAC_ASSOCIATION_INVALID);
        CHECK(memcmp(&ctx, &saved, sizeof(ctx)) == 0 && observation == 0xa5);
    }
    return 0;
}

static uint16_t exhaustive(void)
{
    unsigned n, j;
    uint32_t fcf, address;
    uint8_t *exact;
    for (fcf = 3; fcf <= 0xffffu; fcf += 8) {
        setup();
        body[0] = (uint8_t)fcf; body[1] = (uint8_t)(fcf >> 8);
        CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
        event.stamp = now;
        CHECK(mac_association_step(&ctx, now, &event, &observation) == MAC_ASSOCIATION_OK);
        CHECK((observation == MAC_ASSOCIATION_RESPONSE) == (fcf == 0xcc63 || fcf == 0xcc73));
    }
    for (n = 0; n <= 126; n++) {
        setup();
        exact = malloc(n ? n : 1); CHECK(exact != NULL);
        memset(exact, 0xc7, n);
        memcpy(exact, golden, n < 25 ? n : 25);
        event.body = exact; event.length = (uint16_t)n; event.stamp = now;
        CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_step(&ctx, now, &event, &observation) == MAC_ASSOCIATION_OK);
        CHECK((observation == MAC_ASSOCIATION_RESPONSE) == (n == 25));
        free(exact);
    }
    for (j = 0; j < 25; j++) {
        for (n = 0; n < 256; n++) {
            setup(); body[j] = (uint8_t)n; event.stamp = now;
            CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
            CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
            CHECK(mac_association_step(&ctx, now, &event, &observation) == MAC_ASSOCIATION_OK);
            CHECK((observation == MAC_ASSOCIATION_RESPONSE)
                  == (j == 2 || j == 22 || j == 23 || n == golden[j] || (j == 0 && n == 0x73)));
        }
    }
    for (address = 0; address <= 0xffff; address++) {
        setup(); body[22] = (uint8_t)address; body[23] = (uint8_t)(address >> 8);
        event.stamp = now;
        CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_step(&ctx, now, &event, &observation) == MAC_ASSOCIATION_OK);
        CHECK((observation == MAC_ASSOCIATION_RESPONSE) == (address != 0xffff));
    }
    for (n = 0; n < 256; n++) {
        setup(); body[22] = body[23] = 0xff; body[24] = (uint8_t)n; event.stamp = now;
        CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_step(&ctx, now, &event, &observation) == MAC_ASSOCIATION_OK);
        CHECK((observation == MAC_ASSOCIATION_RESPONSE) == (n == 1 || n == 2));
    }
    /* Invalid contexts, requests, arguments and half-range time are atomic. */
    for (n = 0; n < 17; n++) {
        setup();
        CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
        switch (n) {
        case 0: request.epoch = 0; break;
        case 1: request.lifetime = 0; break;
        case 2: request.lifetime = MAC_ASSOCIATION_MAX_LIFETIME + 1; break;
        case 3: request.work_limit = 0; break;
        case 4: request.work_limit = MAC_ASSOCIATION_MAX_WORK + 1; break;
        case 5: request.pan_id = 0xffff; break;
        case 6: request.channel = 10; break;
        case 7: request.channel = 27; break;
        case 8: request.coordinator_mode = 1; break;
        case 9: case 10:
            request.coordinator_mode = MAC_ADDRESS_SHORT;
            memset(request.coordinator, 0, 8);
            request.coordinator[0] = n == 9 ? 0xfe : 0xff;
            request.coordinator[1] = 0xff; break;
        case 11: request.coordinator_mode = MAC_ADDRESS_SHORT; break; /* nonzero tail */
        case 12: now--; break;
        case 13: now += MAC_ASSOCIATION_HALF; break;
        case 14: ctx.version++; break;
        case 15: ctx.phase = 0xff; break;
        default: break;
        }
        saved = ctx;
        CHECK(mac_association_start(&ctx, n == 16 ? NULL : &request, now) == MAC_ASSOCIATION_INVALID);
        CHECK(memcmp(&ctx, &saved, sizeof(ctx)) == 0);
    }
    for (n = 0; n < 8; n++) {
        setup();
        CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
        CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
        switch (n) {
        case 0: event.kind = 0; break;
        case 1: event.crc_valid = 2; break;
        case 2: event.channel = 10; break;
        case 3: event.channel = 27; break;
        case 4: event.body = NULL; break;
        case 5: now += MAC_ASSOCIATION_HALF; break;
        case 6: now--; break;
        default: break;
        }
        saved = ctx; observation = 0xa5;
        CHECK(mac_association_step(&ctx, now, &event, n == 7 ? NULL : &observation)
              == MAC_ASSOCIATION_INVALID);
        CHECK(observation == 0xa5 && memcmp(&ctx, &saved, sizeof(ctx)) == 0);
    }
    setup(); request.lifetime = MAC_ASSOCIATION_MAX_LIFETIME;
    request.work_limit = MAC_ASSOCIATION_MAX_WORK;
    CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
    CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
    memset(&request, 0, sizeof(request)); /* Start owns its complete copy. */
    for (n = 0; n < MAC_ASSOCIATION_MAX_WORK; n++) {
        CHECK(mac_association_step(&ctx, now, NULL, &observation) == MAC_ASSOCIATION_OK);
        CHECK(observation == (n + 1 == MAC_ASSOCIATION_MAX_WORK
              ? MAC_ASSOCIATION_EXHAUSTED : MAC_ASSOCIATION_WAITING));
    }
    CHECK(mac_association_take(&ctx, &record) == MAC_ASSOCIATION_OK);
    CHECK(record.outcome == MAC_ASSOCIATION_EXHAUSTED && record.epoch == 0x10203040UL);
    setup();
    CHECK(mac_association_init(&ctx, now) == MAC_ASSOCIATION_OK);
    ctx.generation = UINT32_MAX - 1;
    CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_OK);
    CHECK(ctx.generation == UINT32_MAX);
    event.generation = UINT32_MAX;
    event.kind = MAC_ASSOCIATION_CANCEL;
    CHECK(mac_association_step(&ctx, now, &event, &observation) == MAC_ASSOCIATION_OK);
    CHECK(mac_association_take(&ctx, &record) == MAC_ASSOCIATION_OK);
    CHECK(record.generation == UINT32_MAX && record.outcome == MAC_ASSOCIATION_CANCELLED);
    saved = ctx;
    CHECK(mac_association_start(&ctx, &request, now) == MAC_ASSOCIATION_GENERATION_LIMIT);
    CHECK(memcmp(&ctx, &saved, sizeof(ctx)) == 0);
    CHECK(mac_association_start(NULL, &request, now) == MAC_ASSOCIATION_INVALID);
    CHECK(mac_association_step(NULL, now, NULL, &observation) == MAC_ASSOCIATION_INVALID);
    CHECK(mac_association_take(NULL, &record) == MAC_ASSOCIATION_INVALID);
    CHECK(mac_association_take(&ctx, NULL) == MAC_ASSOCIATION_INVALID);
    return 0;
}

int main(void)
{
    uint16_t line = corpus();
    if (!line) line = receive_profiles();
    if (!line) line = exhaustive();
    if (line) {
        fprintf(stderr, "Association context failed C line %u (profile %u, scenario %u, observation %u, expected %u)\n",
                (unsigned)line, profile, scenario, observation, expected);
        return 1;
    }
    puts("Association context: 108 shared scenarios, 24576 FCFs, 6400 byte variants, "
         "3 x 65536 short addresses, 3 x 256 statuses, exact spans and finite/atomic cases PASS");
    return 0;
}
#else
volatile __xdata __at(0x1e00) uint8_t mac_association_result[8];
void main(void)
{
    uint16_t line = corpus();
    mac_association_result[0] = 'A'; mac_association_result[1] = 'S';
    mac_association_result[2] = 'R'; mac_association_result[3] = '1';
    mac_association_result[4] = 1; mac_association_result[5] = 8;
    mac_association_result[6] = (uint8_t)line;
    mac_association_result[7] = (uint8_t)(line >> 8);
    __asm
        .globl _mac_association_done
    _mac_association_done:
        nop
    __endasm;
    for (;;) {}
}
#endif
